In [19]:
import pandas as pd

# Assignment 1: Groupby

Can you return a table containing the top 10 stores by total transactions in the data?

Make sure they’re sorted from highest to lowest.

Thanks!

In [20]:
# Read in transactions data -- parse dates specified here for help with later problem

transaction = pd.read_csv("D:/AA/Programming/Data Science/Python/Maven/Data Analysis With Python AND Pandas/Pandas+Course+Resources/Pandas Course Resources/retail/transactions.csv", parse_dates=["date"])

transaction.head()

        date  store_nbr  transactions
0 2013-01-01         25           770
1 2013-01-02          1          2111
2 2013-01-02          2          2358
3 2013-01-02          3          3487
4 2013-01-02          4          1922

In [21]:
transaction.sort_values

<bound method DataFrame.sort_values of             date  store_nbr  transactions
0     2013-01-01         25           770
1     2013-01-02          1          2111
2     2013-01-02          2          2358
3     2013-01-02          3          3487
4     2013-01-02          4          1922
...          ...        ...           ...
83483 2017-08-15         50          2804
83484 2017-08-15         51          1573
83485 2017-08-15         52          2255
83486 2017-08-15         53           932
83487 2017-08-15         54           802

[83488 rows x 3 columns]>

In [22]:
transaction.groupby(by = "store_nbr")[['transactions']].sum().sort_values(by = "transactions" , ascending = 0).head(15)

           transactions
store_nbr
44              7273093
47              6535810
45              6201115
46              5990113
3               5366350
48              5107785
8               4637971
49              4574103
50              4384444
11              3972488
34              3864018
24              3568206
9               3516162
2               3219901
6               3065896

# Assignment 2: Groupby Multiple Columns

Can you get me the total transactions by store and month? 

Sort the table from first month to last, then by highest transactions to lowest within each month.

In [23]:
# helper code to extract month date part from date column

transaction["month"] = transaction["date"].dt.month

transaction.head()

        date  store_nbr  transactions  month
0 2013-01-01         25           770      1
1 2013-01-02          1          2111      1
2 2013-01-02          2          2358      1
3 2013-01-02          3          3487      1
4 2013-01-02          4          1922      1

In [24]:
transaction

            date  store_nbr  transactions  month
0     2013-01-01         25           770      1
1     2013-01-02          1          2111      1
2     2013-01-02          2          2358      1
3     2013-01-02          3          3487      1
4     2013-01-02          4          1922      1
...          ...        ...           ...    ...
83483 2017-08-15         50          2804      8
83484 2017-08-15         51          1573      8
83485 2017-08-15         52          2255      8
83486 2017-08-15         53           932      8
83487 2017-08-15         54           802      8

[83488 rows x 4 columns]

In [25]:
transaction.groupby(["store_nbr" , "month"])["transactions"]

In [26]:
transaction.groupby(["store_nbr" , "month"])[["transactions"]]

In [27]:
transaction.groupby(["store_nbr" , "month"])["transactions"].sum()

store_nbr  month
1          1        229203
           2        209400
           3        232178
           4        229081
           5        231160
                     ...
54         8        121695
           9        101507
           10       103493
           11       102397
           12       121409
Name: transactions, Length: 641, dtype: int64

In [28]:
transaction.groupby(["store_nbr" , "month"])[["transactions"]].sum()

                 transactions
store_nbr month
1         1            229203
          2            209400
          3            232178
          4            229081
          5            231160
...                       ...
54        8            121695
          9            101507
          10           103493
          11           102397
          12           121409

[641 rows x 1 columns]

In [29]:
(transaction.groupby(["store_nbr" , "month"])[["transactions"]]
 .sum()
 .sort_values(["month" , "transactions"]))

                 transactions
store_nbr month
22        1             39856
21        1             61750
29        1             64689
42        1             64758
53        1             81800
...                       ...
48        12           481640
46        12           558476
45        12           559141
47        12           596689
44        12           660299

[641 rows x 1 columns]

In [30]:
(transaction.groupby(["store_nbr" , "month"])[["transactions"]]
 .sum()
 .sort_values(["month" , "transactions"] , ascending = [1,0]))

                 transactions
store_nbr month
44        1            628438
47        1            568824
45        1            538370
46        1            522763
3         1            463260
...                       ...
32        12            86167
21        12            84128
42        12            76741
29        12            76627
22        12            50650

[641 rows x 1 columns]

In [31]:
(transaction
 .groupby(["store_nbr" , "month"] , as_index= False)[["transactions"]]
 .sum()
 .sort_values(["month" , "transactions"] , ascending = [1,0])
)

     store_nbr  month  transactions
516         44      1        628438
552         47      1        568824
528         45      1        538370
540         46      1        522763
24           3      1        463260
..         ...    ...           ...
383         32     12         86167
251         21     12         84128
503         42     12         76741
347         29     12         76627
263         22     12         50650

[641 rows x 3 columns]

In [32]:
transaction.groupby(["store_nbr" , 'month'])[["transactions"]].count()

                 transactions
store_nbr month
1         1               148
          2               141
          3               155
          4               150
          5               155
...                       ...
54        8               139
          9               120
          10              124
          11              120
          12              120

[641 rows x 1 columns]

# Assignment 3: Multi-Index DataFrames


Can you help me access rows and columns with multiple indices? I’ve been struggling with multi-index DataFrames.

Access:
* Grab Store 3, Month 1
* Then, select the column storing the mean of transactions

Fix:
* Drop the outer layer of the column Index
* Reset the row index so it is the default integer index

In [33]:
(
    transaction
 .groupby(["store_nbr" , "month"])[["transactions"]]
 .mean().round(2)
    .loc[[(3,1)]]
)

                 transactions
store_nbr month
3         1           3151.43

In [34]:
(
    transaction
 .groupby(["store_nbr" , "month"])[["transactions"]]
 .mean()
 .query("month == 1")
    .query("store_nbr ==3")
 .round(2)
)

                 transactions
store_nbr month
3         1           3151.43

In [35]:
transaction.droplevel()

TypeError: NDFrame.droplevel() missing 1 required positional argument: 'level'

In [36]:
transaction.head()

        date  store_nbr  transactions  month
0 2013-01-01         25           770      1
1 2013-01-02          1          2111      1
2 2013-01-02          2          2358      1
3 2013-01-02          3          3487      1
4 2013-01-02          4          1922      1

In [37]:
trans_agged = transaction.groupby(["store_nbr" , "month"]).agg({"transactions" : ["sum" , "mean" , "min" , "max"]})
trans_agged

                transactions
                         sum         mean  min   max
store_nbr month
1         1           229203  1548.668919   10  2111
          2           209400  1485.106383  374  2130
          3           232178  1497.922581  346  1965
          4           229081  1527.206667  414  2133
          5           231160  1491.354839  411  2087
...                      ...          ...  ...   ...
54        8           121695   875.503597  630  1343
          9           101507   845.891667  619  1291
          10          103493   834.620968  629  1250
          11          102397   853.308333  608  1331
          12          121409  1011.741667  675  1811

[641 rows x 4 columns]

In [38]:
trans_agged.loc[[(1,2,4,3,6)]]

                transactions
                         sum         mean  min   max
store_nbr month
1         2           209400  1485.106383  374  2130

In [39]:
trans_agged.loc[[(1,2,2,3)]]

                transactions
                         sum         mean  min   max
store_nbr month
1         2           209400  1485.106383  374  2130

In [40]:
transaction.groupby(["store_nbr" , "month"])[["transactions"]].sum().loc[(1,1):(5,1)]

                 transactions
store_nbr month
1         1            229203
          2            209400
          3            232178
          4            229081
          5            231160
          6            231514
          7            236032
          8            202821
          9            182035
          10           184419
          11           175957
          12           210163
2         1            284134
          2            265922
          3            293076
          4            287325
          5            293588
          6            284835
          7            288783
          8            255475
          9            228658
          10           232326
          11           227973
          12           277806
3         1            463260
          2            437238
          3            487224
          4            478308
          5            491961
          6            474668
          7            484698
          8            431752
          9            379101
          10           387766
          11           379532
          12           470842
4         1            222075
          2            209211
          3            231837
          4            223928
          5            228753
          6            222678
          7            224327
          8            200100
          9            178172
          10           181158
          11           175753
          12           221015
5         1            208297

In [41]:
transaction.groupby(["store_nbr" , "month"])[["transactions"]].sum().loc[(1,1):(5,1)].index

MultiIndex([(1,  1),
            (1,  2),
            (1,  3),
            (1,  4),
            (1,  5),
            (1,  6),
            (1,  7),
            (1,  8),
            (1,  9),
            (1, 10),
            (1, 11),
            (1, 12),
            (2,  1),
            (2,  2),
            (2,  3),
            (2,  4),
            (2,  5),
            (2,  6),
            (2,  7),
            (2,  8),
            (2,  9),
            (2, 10),
            (2, 11),
            (2, 12),
            (3,  1),
            (3,  2),
            (3,  3),
            (3,  4),
            (3,  5),
            (3,  6),
            (3,  7),
            (3,  8),
            (3,  9),
            (3, 10),
            (3, 11),
            (3, 12),
            (4,  1),
            (4,  2),
            (4,  3),
            (4,  4),
            (4,  5),
            (4,  6),
            (4,  7),
            (4,  8),
            (4,  9),
            (4, 10),
            (4, 11),
            (4, 12),
            (5,  1)],
           names=['store_nbr', 'month'])

In [42]:
transaction.index

RangeIndex(start=0, stop=83488, step=1)

#### Let's jump into the exercises:

In [43]:
transaction.groupby(["store_nbr" , "month"])[["transactions"]].sum().loc[(1,9) : (5,1) , :]

                 transactions
store_nbr month
1         9            182035
          10           184419
          11           175957
          12           210163
2         1            284134
          2            265922
          3            293076
          4            287325
          5            293588
          6            284835
          7            288783
          8            255475
          9            228658
          10           232326
          11           227973
          12           277806
3         1            463260
          2            437238
          3            487224
          4            478308
          5            491961
          6            474668
          7            484698
          8            431752
          9            379101
          10           387766
          11           379532
          12           470842
4         1            222075
          2            209211
          3            231837
          4            223928
          5            228753
          6            222678
          7            224327
          8            200100
          9            178172
          10           181158
          11           175753
          12           221015
5         1            208297

In [44]:
# Ross' grouped DataFrame code, run this first

grouped = (
    transaction.groupby(["store_nbr", "month"] )
    .agg({"transactions": ["sum", "mean"]})
    .sort_values(["month", ("transactions", "sum")], ascending=[True, False])
)

In [45]:
grouped.swaplevel()

                transactions
                         sum         mean
month store_nbr
1     44              628438  4246.202703
      47              568824  3843.405405
      45              538370  3637.635135
      46              522763  3532.182432
      3               463260  3151.428571
...                      ...          ...
12    32               86167   718.058333
      21               84128  1402.133333
      42               76741  1279.016667
      29               76627  1277.116667
      22               50650   844.166667

[641 rows x 2 columns]

In [46]:
grouped.round(2).droplevel(0,0)

      transactions
               sum     mean
month
1           628438  4246.20
1           568824  3843.41
1           538370  3637.64
1           522763  3532.18
1           463260  3151.43
...            ...      ...
12           86167   718.06
12           84128  1402.13
12           76741  1279.02
12           76627  1277.12
12           50650   844.17

[641 rows x 2 columns]

In [47]:
grouped.round(2).droplevel(0,1)

                    sum     mean
store_nbr month
44        1      628438  4246.20
47        1      568824  3843.41
45        1      538370  3637.64
46        1      522763  3532.18
3         1      463260  3151.43
...                 ...      ...
32        12      86167   718.06
21        12      84128  1402.13
42        12      76741  1279.02
29        12      76627  1277.12
22        12      50650   844.17

[641 rows x 2 columns]

In [48]:
grouped.round(2).droplevel(1,1)

                 transactions  transactions
store_nbr month
44        1            628438       4246.20
47        1            568824       3843.41
45        1            538370       3637.64
46        1            522763       3532.18
3         1            463260       3151.43
...                       ...           ...
32        12            86167        718.06
21        12            84128       1402.13
42        12            76741       1279.02
29        12            76627       1277.12
22        12            50650        844.17

[641 rows x 2 columns]

In [49]:
grouped.round(2).droplevel(1,0)

          transactions
                   sum     mean
store_nbr
44              628438  4246.20
47              568824  3843.41
45              538370  3637.64
46              522763  3532.18
3               463260  3151.43
...                ...      ...
32               86167   718.06
21               84128  1402.13
42               76741  1279.02
29               76627  1277.12
22               50650   844.17

[641 rows x 2 columns]

In [50]:
grouped.round(2).droplevel(0,1)

                    sum     mean
store_nbr month
44        1      628438  4246.20
47        1      568824  3843.41
45        1      538370  3637.64
46        1      522763  3532.18
3         1      463260  3151.43
...                 ...      ...
32        12      86167   718.06
21        12      84128  1402.13
42        12      76741  1279.02
29        12      76627  1277.12
22        12      50650   844.17

[641 rows x 2 columns]

In [51]:
grouped.reset_index()

    store_nbr month transactions
                             sum         mean
0          44     1       628438  4246.202703
1          47     1       568824  3843.405405
2          45     1       538370  3637.635135
3          46     1       522763  3532.182432
4           3     1       463260  3151.428571
..        ...   ...          ...          ...
636        32    12        86167   718.058333
637        21    12        84128  1402.133333
638        42    12        76741  1279.016667
639        29    12        76627  1277.116667
640        22    12        50650   844.166667

[641 rows x 4 columns]

In [52]:
grouped.reset_index().loc[: , ["month"]].eq(3)

     month

0    False
1    False
2    False
3    False
4    False
..     ...
636  False
637  False
638  False
639  False
640  False

[641 rows x 1 columns]

In [53]:
# df grouped by store and month with two aggregation columns

grouped.head()

                transactions
                         sum         mean
store_nbr month
44        1           628438  4246.202703
47        1           568824  3843.405405
45        1           538370  3637.635135
46        1           522763  3532.182432
3         1           463260  3151.428571

# Assignment 4: The Agg Method

Calculate the mean of target met by store, and the sum of bonuses to be paid to each store.

Sort them by highest to lowest bonus payout.

Then, do the same for day of week and month.

In [54]:
# Recreate table from section 3

transaction = transaction.assign(
    target_pct=(transaction["transactions"] / 2500).round(2),
    met_target=(transaction["transactions"] / 2500) >= 1,
    bonus_payable=((transaction["transactions"] / 2500) >= 1) * 100,
    month=transaction.date.dt.month,
    day_of_week=transaction.date.dt.dayofweek,
)

transaction.head()

,date,store_nbr,transactions,month,target_pct,met_target,bonus_payable,day_of_week
0,2013-01-01,25,770,1,0.31,False,0,1
1,2013-01-02,1,2111,1,0.84,False,0,2
2,2013-01-02,2,2358,1,0.94,False,0,2
3,2013-01-02,3,3487,1,1.39,True,100,2
4,2013-01-02,4,1922,1,0.77,False,0,2

In [55]:
transaction.groupby(["store_nbr"])[["met_target"]].mean().round(2).head()

           met_target
store_nbr
1                0.01
2                0.02
3                1.00
4                0.01
5                0.01

In [56]:
(transaction.groupby("store_nbr")
 .agg({
     "met_target" : "mean" , 
     "bonus_payable" : "sum"
 })
 .round(2)
 .sort_values(by = ["bonus_payable"] , ascending = 0)
).head(10)

           met_target  bonus_payable
store_nbr
47               1.00         167600
44               1.00         167500
45               1.00         167300
3                1.00         167300
46               0.99         165900
8                0.89         148900
48               0.69         115800
49               0.64         106900
50               0.45          76000
11               0.30          49700

In [57]:
(transaction.groupby(["month" , "day_of_week"])
 .agg({
     "met_target" : "mean" , 
     "bonus_payable" : "sum"
 })
 .round(2)
 .sort_values(by = ["bonus_payable"] , ascending = [0])
).head(14)

                   met_target  bonus_payable
month day_of_week
5     5                  0.24          26000
12    5                  0.29          24600
3     5                  0.22          24200
12    1                  0.25          24200
4     5                  0.22          24100
3     6                  0.21          23700
6     5                  0.22          23000
12    2                  0.27          22900
5     6                  0.21          22900
2     5                  0.23          22700
7     5                  0.20          22700
4     6                  0.22          22600
1     5                  0.21          22400
8     5                  0.21          22100

In [58]:
(transaction.groupby(["month" , "day_of_week"])
 .agg({
     "target_pct" : "mean" , 
     "bonus_payable" : "sum"
 })
 .round(2)
 .sort_values(by = ["month" , "day_of_week" , "bonus_payable"] , ascending = [1,1,0])
).head(14)

                   target_pct  bonus_payable
month day_of_week
1     0                  0.64          14600
      1                  0.62          13700
      2                  0.63          16000
      3                  0.60          14100
      4                  0.65          18400
      5                  0.77          22400
      6                  0.74          20400
2     0                  0.64          16600
      1                  0.64          14600
      2                  0.64          15700
      3                  0.62          14500
      4                  0.67          18300
      5                  0.78          22700
      6                  0.70          19300

In [59]:
(transaction.groupby(["month" , "day_of_week"])
 .agg({
     "met_target" : "mean" , 
     "bonus_payable" : "sum"})
 .round(2)
 .reset_index()
 .sort_values(by = ["bonus_payable"] , ascending = [0])
).head(14)

    month  day_of_week  met_target  bonus_payable
33      5            5        0.24          26000
82     12            5        0.29          24600
19      3            5        0.22          24200
78     12            1        0.25          24200
26      4            5        0.22          24100
20      3            6        0.21          23700
40      6            5        0.22          23000
79     12            2        0.27          22900
34      5            6        0.21          22900
12      2            5        0.23          22700
47      7            5        0.20          22700
27      4            6        0.22          22600
5       1            5        0.21          22400
54      8            5        0.21          22100

# Assignment 4: Transform

Calculate the mean of transactions by store number and day of week while keeping row numbers. 

Then compare the performance of each row to its day of week average. (difference between transactions and daily avg)

In [60]:
transaction.reset_index()

,index,date,store_nbr,transactions,month,target_pct,met_target,bonus_payable,day_of_week
0,0,2013-01-01,25,770,1,0.31,False,0,1
1,1,2013-01-02,1,2111,1,0.84,False,0,2
2,2,2013-01-02,2,2358,1,0.94,False,0,2
3,3,2013-01-02,3,3487,1,1.39,True,100,2
4,4,2013-01-02,4,1922,1,0.77,False,0,2
...,...,...,...,...,...,...,...,...,...
83483,83483,2017-08-15,50,2804,8,1.12,True,100,1
83484,83484,2017-08-15,51,1573,8,0.63,False,0,1
83485,83485,2017-08-15,52,2255,8,0.90,False,0,1
83486,83486,2017-08-15,53,932,8,0.37,False,0,1
83487,83487,2017-08-15,54,802,8,0.32,False,0,1

In [61]:
transaction.assign(store_avg_trans = transaction
                   .groupby(["store_nbr" , "day_of_week"])["transactions"]
                   .transform("mean") ,
                   trans_vs_avg = lambda x : (x["transactions"] - x["store_avg_trans"]).round(2)
                  )

,date,store_nbr,transactions,month,target_pct,met_target,bonus_payable,day_of_week,store_avg_trans,trans_vs_avg
0,2013-01-01,25,770,1,0.31,False,0,1,740.245690,29.75
1,2013-01-02,1,2111,1,0.84,False,0,2,1870.782427,240.22
2,2013-01-02,2,2358,1,0.94,False,0,2,1952.652720,405.35
3,2013-01-02,3,3487,1,1.39,True,100,2,3142.682008,344.32
4,2013-01-02,4,1922,1,0.77,False,0,2,1499.569038,422.43
...,...,...,...,...,...,...,...,...,...,...
83483,2017-08-15,50,2804,8,1.12,True,100,1,2342.410788,461.59
83484,2017-08-15,51,1573,8,0.63,False,0,1,1548.448133,24.55
83485,2017-08-15,52,2255,8,0.90,False,0,1,1892.588235,362.41
83486,2017-08-15,53,932,8,0.37,False,0,1,877.214286,54.79
83487,2017-08-15,54,802,8,0.32,False,0,1,817.721992,-15.72

In [62]:
transaction.assign(store_avg_trans = transaction
                   .groupby(["store_nbr" , "day_of_week"])["transactions"]
                   .transform("mean") ,
                   trans_vs_avg = lambda x : (x["transactions"] - x["store_avg_trans"]).round(2)
                  ).query("trans_vs_avg > 0").sort_values("trans_vs_avg" , ascending = 0)

,date,store_nbr,transactions,month,target_pct,met_target,bonus_payable,day_of_week,store_avg_trans,trans_vs_avg
16619,2013-12-24,46,7840,12,3.14,True,100,1,3064.995851,4775.00
16572,2013-12-23,46,8001,12,3.20,True,100,0,3275.304167,4725.70
52066,2015-12-24,46,7594,12,3.04,True,100,3,2993.133891,4600.87
52068,2015-12-24,48,7044,12,2.82,True,100,3,2523.393305,4520.61
33702,2014-12-23,46,7447,12,2.98,True,100,1,3064.995851,4382.00
...,...,...,...,...,...,...,...,...,...,...
900,2013-01-21,30,692,1,0.28,False,0,0,691.978903,0.02
18512,2014-02-05,6,1759,2,0.70,False,0,2,1758.983264,0.02
24218,2014-06-07,28,1323,6,0.53,False,0,5,1322.975104,0.02
55736,2016-03-07,9,2085,3,0.83,False,0,0,2084.991667,0.01
46701,2015-09-14,9,2085,9,0.83,False,0,0,2084.991667,0.01

In [63]:
transaction['store_avg_trans'] = transaction.groupby(["store_nbr", "day_of_week"])["transactions"].mean()
transaction

TypeError: incompatible index of inserted column with frame index

# Assignment 5: Pivot

Pivot transactions with store number as index, columns day of week, with the sum of bonus payable as cells.

Filter to stores that had a non-zero bonus payable and create a heatmap.

Then unpivot (melt) the table so we have one row for each store and day of the week with the corresponding total owed.

In [64]:
# Use transactions table (ok if includes columns from assignment 4 or not)

transaction.head()

,date,store_nbr,transactions,month,target_pct,met_target,bonus_payable,day_of_week
0,2013-01-01,25,770,1,0.31,False,0,1
1,2013-01-02,1,2111,1,0.84,False,0,2
2,2013-01-02,2,2358,1,0.94,False,0,2
3,2013-01-02,3,3487,1,1.39,True,100,2
4,2013-01-02,4,1922,1,0.77,False,0,2

In [72]:
transaction['store_nbr'][1:11+1:1]

1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
Name: store_nbr, dtype: int64

In [80]:
transaction["day_of_week"].unique()

array([1, 2, 3, 4, 5, 6, 0])

In [83]:
transaction.columns

Index(['date', 'store_nbr', 'transactions', 'month', 'target_pct',
       'met_target', 'bonus_payable', 'day_of_week'],
      dtype='object')

In [110]:
transaction_pv = (transaction
 .loc[transaction["bonus_payable"] != 0]
 .pivot_table(values = "bonus_payable" ,
              index = 'store_nbr' ,
              columns = "day_of_week",
              aggfunc ="sum")
 .iloc[:10].round(2)
 .style.background_gradient(cmap = 'RdYlGn' , axis = 0))

In [111]:
transaction_pv

In [139]:
transaction_pv2 = transaction.loc[transaction["bonus_payable"] != 0].pivot_table(
    values = "bonus_payable" ,
    index = 'store_nbr' ,
    columns = "day_of_week",b
    aggfunc ="sum").iloc[:10].round(2)

In [143]:
transaction_pv2.reset_index().melt(id_vars = ["store_nbr"] , 
                    var_name = "dat_of_week",
                    value_name = "bonus_payable")

    store_nbr dat_of_week  bonus_payable
0           1           0          200.0
1           2           0          300.0
2           3           0        24000.0
3           4           0          200.0
4           5           0          200.0
..        ...         ...            ...
65          6           6          300.0
66          7           6            NaN
67          8           6        20000.0
68          9           6         5100.0
69         11           6        17600.0

[70 rows x 3 columns]

In [ ]:
import nltk
from nltk.corpus import wordnet
import seaborn as sns
import pandas as pd
import numpy as np

nltk.download('wordnet')

# Let's say your word is 'peculiar'
synonyms = []
for syn in wordnet.synsets('peculiar'):
    for lemma in syn.lemmas():
        synonyms.append(lemma.name())

# Create a dataframe to hold the likelihoods
df = pd.DataFrame(data=np.random.rand(len(synonyms), len(synonyms)), 
                  index=synonyms, columns=synonyms)

# Plot a heatmap
sns.heatmap(df)

In [ ]:
import nltk
from nltk.corpus import wordnet
import matplotlib.pyplot as plt

nltk.download('wordnet')

# Let's say your word is 'peculiar'
synonyms = []
for syn in wordnet.synsets('peculiar'):
    for lemma in syn.lemmas():
        synonyms.append(lemma.name())

# For simplicity, let's assign random relevance scores (in real scenario, you might use a more sophisticated method)
relevance = np.random.rand(len(synonyms))

# Create a color map
cmap = plt.get_cmap("cool")

# Create a figure and axis
fig, ax = plt.subplots()

# Create a color bar
sm = plt.cm.ScalarMappable(cmap=cmap)
plt.colorbar(sm)

# Plot each synonym with a color that corresponds to its relevance
for i, synonym in enumerate(synonyms):
    ax.text(0.5, i, synonym, color=cmap(relevance[i]))

plt.show()